tutorials/mesh/createPatch/multiRegionHeater_autoPatch/0.orig/topAir/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/topAir";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -1 -2 0 0 0 0 ];

internalField   uniform 100000;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    maxY
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    minX
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    maxX
    {
        type            uniformFixedValue;
        uniformValue    100000;
    }
    minZ
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    maxZ
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    group_solid
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
    group_fluid
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }
}


// ************************************************************************* //
